<?php

namespace App\Models;

use App\Models\Traits\Basis;
use App\Models\Traits\CustomHasTranslations;
use App\Models\Traits\HasValidateUnique;
use App\Models\Traits\LikeScope;
use Illuminate\Database\Eloquent\Relations\HasMany;
use Illuminate\Support\Facades\Cache;

class Country extends Model
{
    use Basis,
        CustomHasTranslations,
        HasValidateUnique,
        LikeScope;

    protected $table = 'dsp_country';

    public const TEMPLATE_TYPE_DEFAULT = 0;
    public const TEMPLATE_TYPE_ASIA = 1;
    public const TEMPLATE_TYPE_EUROPE = 2;
    public const TEMPLATE_TYPE_AFRICA = 3;
    public const TEMPLATE_TYPE_NORTH_AMERICA = 4;
    public const TEMPLATE_TYPE_OCEANIA = 5;


    public $translatable = ['name'];

    protected $guarded = [];

    protected $hidden = [];

    protected $casts = [
        'rgb_color' => 'array',
    ];

    protected $appends = [];

    /**
     * @return HasMany
     */
    public function areas(): HasMany
    {
        return $this->hasMany(CountryArea::class, 'country_id', 'id')
                    ->whereNull('parent_id')
                    ->withoutGlobalScope('enabled');
    }

    public function stations()
    {
        return $this->hasMany(SelfPickupStation::class, 'country_id', 'id');
    }

    /**
     * 关联的渠道邮编区域
     *
     * @return HasMany
     */
    public function regions(): HasMany
    {
        return $this->hasMany(ExpressLineRegion::class, 'country_id', 'id');
    }

    /**
     * 国家ID是否全都存在
     * @param array $ids
     * @return bool
     */
    public static function isValid(array $ids): bool
    {
        return self::whereIn('id', $ids)->count() === count(array_unique($ids));
    }

    /*public function getCnNameAttribute($value)
    {
        $local = app('translator')->getLocale();

        //对于宇盟始终返回英文国家名
        // if (self::getCompanyId() === 26) {
        //     return $this->en_name;
        // }

        if ($local !== 'zh_CN') {
            return $this->en_name;
        }

        return $value;
    }*/

    public static function templateTypeList()
    {
        return [
            self::TEMPLATE_TYPE_DEFAULT       => __('空白模板'),
            self::TEMPLATE_TYPE_ASIA          => __('亚洲模板'),
            self::TEMPLATE_TYPE_EUROPE        => __('欧洲模板'),
            self::TEMPLATE_TYPE_AFRICA        => __('非洲模板'),
            self::TEMPLATE_TYPE_NORTH_AMERICA => __('南美洲模板'),
            self::TEMPLATE_TYPE_OCEANIA       => __('大洋洲模板')
        ];
    }

    /**
     * @param string $code
     * @return int[]|mixed
     */
    public static function getCountryColor(string $code): mixed
    {
        if (!$code) {
            return [0, 0, 0];
        }

        $data = self::getCacheData();

        return collect($data)->firstWhere('code', $code)['rgb_color'] ?? [0, 0, 0];
    }

    /**
     * @param int $id
     * @param string $origin
     * @param string $code
     * @return int[]|mixed
     */
    public static function getI18nCountryName(int $id, string $origin, string $code = ''): mixed
    {
        $data = self::getCacheData();

        $locale = app()->getLocale();

        if ($code) {
            $name = collect($data)->firstWhere('code', $code)['name'][$locale] ?? null;

            if ($name) {
                return $name;
            }
        }

        return collect($data)->firstWhere('id', $id)['name'][$locale] ?? $origin;
    }

    /**
     * @return mixed
     */
    public static function getCacheData(): mixed
    {
        $key = 'country-data-';

        return Cache::get($key, function () use ($key) {
            return self::cacheData($key);
        });
    }

    /**
     * @param string $key
     * @return array
     */
    public static function cacheData(string $key): array
    {
        $data = self::all()->map(function (self $v) {
            return $v->toBaseArray();
        })->all();

        Cache::put($key, $data);

        return $data;
    }

    public static function booted()
    {
        parent::booted();
        //客户端不展示不启用的国家
        if (stripos(request()->path(), 'api/client') === 0) {
            static::addGlobalScope('enabled', function ($builder) {
                $builder->where('enabled', 1);
            });
        }

        static::updated(function ($model) {
            $key = 'country-data-';
            self::cacheData($key);
        });
    }

    /**
     * 欧盟成员国
     */
    public static function EuropeanUnionMemberStates(): array
    {
        return [
            'AT',//奥地利(Austria)
            'BE',//比利时(Belgium)
            'BG',//保加利亚(Bulgaria)
            'CY',//塞浦路斯(Cyprus)
            'HR',//克罗地亚( Croatia)
            'CZ',//捷克(Czechia)
            'DK',//丹麦(Denmark)
            'EE',//爱沙尼亚(Estonia)
            'FI',//芬兰(Finland)
            'FR',//法国(France)
            'DE',//德国(Germany)
            'GR',//希腊(Greece)
            'HU',//匈牙利(Hungary)
            'IE',//爱尔兰(Ireland)
            'IT',//意大利(Italy)
            'LV',//拉脱维亚(Latvia)
            'LT',//立陶宛(Lithuania)
            'LU',//卢森堡(Luxembourg)
            'MT',//马耳他(Malta)
            'NL',//荷兰(Netherlands)
            'PL',//波兰(Poland)
            'PT',//葡萄牙(Portugal)
            'RO',//罗马尼亚(Romania)
            'SK',//斯洛伐克(Slovakia)
            'SI',//斯洛文尼亚(Slovenia)
            'ES',//西班牙(Spain)
            'SE',//瑞典(Sweden)
        ];
    }

    /**
     * 中文国家名称 俄语国家名称
     */
    public static function getRuName($cnName): string
    {
        $list = [
            '喀麦隆'                          => 'Камерун',
            '布基纳法索'                      => 'Буркина-Фасо',
            '留尼汪'                          => 'Воссоединение',
            '马约特岛'                        => 'Майотта',
            '莱索托'                          => 'Лесото',
            '纳米比亚'                        => 'Намибия',
            '阿尔及利亚'                      => 'Алжир',
            '乌兹别克斯坦'                    => 'Узбекистан',
            '老挝'                            => 'Лаос',
            '科威特'                          => 'Кувейт',
            '马来西亚'                        => 'Малайзия',
            '土库曼斯坦'                      => 'Туркменистан',
            '卡塔尔'                          => 'Катар',
            '东帝汶'                          => 'Восточный Тимор',
            '文莱'                            => 'Бруней',
            '阿富汗'                          => 'Афганистан',
            '巴林'                            => 'Бахрейн',
            '吉布提'                          => 'Джибути',
            '莫桑比克'                        => 'Мозамбик',
            '刚果'                            => 'Конго',
            '科摩罗'                          => 'Коморские острова',
            '加蓬'                            => 'Габон',
            '厄立特里亚'                      => 'Эритрея',
            '贝宁'                            => 'Бенин',
            '马达加斯加'                      => 'Мадагаскар',
            '卢旺达'                          => 'Руанда',
            '塞舌尔'                          => 'Сейшельские острова',
            '圣多美和普林西比'                => 'Сан-Томе и Принсипи',
            '加纳'                            => 'Гана',
            '博茨瓦纳'                        => 'Ботсвана',
            '南非'                            => 'Южная Африка',
            '埃塞俄比亚'                      => 'Эфиопия',
            '冈比亚'                          => 'Гваделупа',
            '日本'                            => 'Япония',
            '中国澳门'                        => 'Макао',
            '马尔代夫'                        => 'Мальдивы',
            '也门'                            => 'Йемен',
            '尼泊尔'                          => 'Непал',
            '哈萨克斯坦'                      => 'Казахстан',
            '不丹'                            => 'Бутан',
            '印度尼西亚'                      => 'Индонезия',
            '塔吉克斯坦'                      => 'Таджикистан',
            '约旦'                            => 'Иордания',
            '赤道几内亚'                      => 'Экваториальная Гвинея',
            '摩洛哥'                          => 'Марокко',
            '突尼斯'                          => 'Тунис',
            '利比里亚'                        => 'Либерия',
            '塞内加尔'                        => 'Сенегал',
            '坦桑尼亚'                        => 'Танзания',
            '马里'                            => 'Мали',
            '安哥拉'                          => 'Ангола',
            '科特迪瓦'                        => 'Кот-д’Ивуар',
            '埃及'                            => 'Египет',
            '毛里求斯'                        => 'Маврикий',
            '利比亚'                          => 'Ливия',
            '津巴布韦'                        => 'Зимбабве',
            '几内亚'                          => 'Гвинея',
            '塞拉利昂'                        => 'Сьерра-Леоне',
            '乍得'                            => 'Чад',
            '乌干达'                          => 'Уганда',
            '毛里塔尼亚'                      => 'Мавритания',
            '索马里'                          => 'Сомали',
            '斯威士兰'                        => 'Эсватини',
            '几内亚比绍'                      => 'Гвинея-Бисау',
            '民主刚果'                        => 'ДР Конго',
            '中非'                            => 'Центральноафриканская Республика',
            '多哥'                            => 'Того',
            '西撒哈拉'                        => 'Западная Сахара',
            '尼日尔'                          => 'Нигер',
            '赞比亚'                          => 'Замбия',
            '马拉维'                          => 'Малави',
            '苏丹'                            => 'Судан',
            '越南'                            => 'Вьетнам',
            '朝鲜'                            => 'Северная Корея',
            '以色列'                          => 'Израиль',
            '柬埔寨'                          => 'Камбоджа',
            '菲律宾'                          => 'Филиппины',
            '巴基斯坦'                        => 'Пакистан',
            '蒙古'                            => 'Монголия',
            '巴勒斯坦'                        => 'Палестина',
            '吉尔吉斯斯坦'                    => 'Кыргызстан',
            '肯尼亚'                          => 'Кения',
            '尼日利亚'                        => 'Нигерия',
            '佛得角'                          => 'Кабо-Верде',
            '新加坡'                          => 'Сингапур',
            '布隆迪'                          => 'Бурунди',
            '韩国'                            => 'Южная Корея',
            '叙利亚'                          => 'Сирия',
            '阿联酋'                          => 'Объединенные Арабские Эмираты',
            '斯里兰卡'                        => 'Шри-Ланка',
            '泰国'                            => 'Таиланд',
            '中国香港'                        => 'Гонконг',
            '伊拉克'                          => 'Ирак',
            '黎巴嫩'                          => 'Ливан',
            '缅甸'                            => 'Мьянма',
            '印度'                            => 'Индия',
            '阿曼'                            => 'Оман',
            '孟加拉国'                        => 'Бангладеш',
            '沙特阿拉伯'                      => 'Саудовская Аравия',
            '中国台湾'                        => 'Тайвань',
            '中国'                            => 'Китай',
            '伊朗'                            => 'Иран',
            '萨尔瓦多'                        => 'Сальвадор',
            '荷属安地列斯群岛'                => 'Нидерландские Антильские острова',
            '巴拿马'                          => 'Панама',
            '尼加拉瓜'                        => 'Никарагуа',
            '墨西哥'                          => 'Мексика',
            '多米尼加'                        => 'Доминиканский',
            '古巴'                            => 'Куба',
            '哥斯达黎加'                      => 'Коста-Рика',
            '波多黎各'                        => 'Пуэрто-Рико',
            '圣文森特和格纳丁斯'              => 'Сент-Винсент и Гренадины',
            '洪都拉斯'                        => 'Гондурас',
            '危地马拉'                        => 'Гватемала',
            '格鲁吉亚'                        => 'Грузия',
            '亚美尼亚'                        => 'Армения',
            '阿塞拜疆'                        => 'Азербайджан',
            '罗马尼亚'                        => 'Румыния',
            '挪威'                            => 'Норвегия',
            '摩纳哥'                          => 'Монако',
            '马耳他'                          => 'Мальта',
            '冰岛'                            => 'Исландия',
            '匈牙利'                          => 'Венгрия',
            '乌克兰'                          => 'Украина',
            '俄罗斯联邦'                      => 'Россия',
            '白俄罗斯'                        => 'Беларусь',
            '圣马力诺'                        => 'Сан-Марино',
            '瑞典'                            => 'Швеция',
            '瑞士'                            => 'Швейцария',
            '爱沙尼亚'                        => 'Эстония',
            '拉脱维亚'                        => 'Латвия',
            '立陶宛'                          => 'Литва',
            '摩尔多瓦'                        => 'Молдова',
            '土耳其'                          => 'Турция',
            '斯洛文尼亚'                      => 'Словения',
            '捷克'                            => 'Чешский',
            '爱尔兰'                          => 'Ирландия',
            '斯洛伐克'                        => 'Словакия',
            '比利时'                          => 'Бельгия',
            '马其顿'                          => 'Северная Македония',
            '塞浦路斯'                        => 'Кипр',
            '波斯尼亚和黑塞哥维那'            => 'Босния Герцеговина',
            '丹麦'                            => 'Дания',
            '英国'                            => 'Великобритания',
            '德国'                            => 'Германия',
            '法国'                            => 'Франция',
            '意大利'                          => 'Италия',
            '梵蒂冈城国'                      => 'Государство Ватикан',
            '荷兰'                            => 'Нидерланды',
            '克罗地亚'                        => 'Хорватия',
            '希腊'                            => 'Греция',
            '卢森堡'                          => 'Люксембург',
            '保加利亚'                        => 'Болгария',
            '澳大利亚'                        => 'Австралия',
            '密克罗尼西亚联邦'                => 'Микронезия',
            '帕劳'                            => 'Палау',
            '智利'                            => 'Чили',
            '哥伦比亚'                        => 'Колумбия',
            '马绍尔群岛'                      => 'Маршалловы Острова',
            '库克群岛'                        => 'Острова Кука',
            '芬兰'                            => 'Финляндия',
            '葡萄牙'                          => 'Португалия',
            '波兰'                            => 'Польша',
            '直布罗陀'                        => 'Гибралтар',
            '瑙鲁'                            => 'Науру',
            '新喀里多尼亚'                    => 'Новая Каледония',
            '多米尼克'                        => 'Доминика',
            '西班牙'                          => 'Испания',
            '阿尔巴尼亚'                      => 'Албания',
            '百慕大'                          => 'Бермуды',
            '瓦努阿图'                        => 'Вануату',
            '基里巴斯'                        => 'Кирибати',
            '圭亚那'                          => 'Гайана',
            '巴拉圭'                          => 'Парагвай',
            '法属玻利尼西亚'                  => 'Французская Полинезия',
            '秘鲁'                            => 'Перу',
            '新西兰'                          => 'Новая Зеландия',
            '所罗门群岛'                      => 'Соломоновы Острова',
            '加拿大'                          => 'Канада',
            '安道尔'                          => 'Андорра',
            '列支敦士登'                      => 'Лихтенштейн',
            '美国'                            => 'США',
            '斐济'                            => 'Фиджи',
            '萨摩亚'                          => 'Самоа',
            '格陵兰'                          => 'Гренландия',
            '塞黑'                            => 'Сербия',
            '奥地利'                          => 'Австрия',
            '汤加'                            => 'Тонга',
            '图瓦卢'                          => 'Тувалу',
            '巴布亚新几内亚'                  => 'Папуа-Новая Гвинея',
            '苏里南'                          => 'Суринам',
            '委内瑞拉'                        => 'Венесуэла',
            '乌拉圭'                          => 'Уругвай',
            '厄瓜多尔'                        => 'Эквадор',
            '牙买加'                          => 'Ямайка',
            '伯利兹'                          => 'Белиз',
            '博内尔岛、圣尤斯特歇斯岛和萨巴岛' => 'Бонайре Синт-Эстатиус и Саба',
            '法罗群岛'                        => 'Фарерские острова',
            '法属圭亚那'                      => 'Французская Гвиана',
            '玻利维亚'                        => 'Боливия',
            '马提尼克'                        => 'Мартиника',
            '安提瓜和巴布达'                  => 'Антигуа и Барбуда',
            '阿鲁巴岛'                        => 'Аруба',
            '蒙特塞拉特'                      => 'Монтсеррат',
            '巴西'                            => 'Бразилия',
            '根西岛'                          => 'Гернси',
            '布韦岛'                          => 'Остров Буве',
            '美属萨摩亚群岛'                  => 'Американское Самоа',
            '特立尼达和多巴哥'                => 'Тринидад и Тобаго',
            '巴哈马'                          => 'Багамские острова',
            '巴巴多斯'                        => 'Барбадос',
            '开曼群岛'                        => 'Каймановы острова',
            '格林纳达'                        => 'Гренада',
            '海地'                            => 'Гаити',
            '阿根廷'                          => 'Аргентина',
            '圣皮埃尔和密克隆'                => 'Сен-Пьер и Микелон',
            '圣其茨-尼维斯'                   => 'Сент-Китс и Невис',
            '奥兰群岛'                        => 'Аландские острова',
            '圣巴托洛缪岛'                    => 'Сен-Бартелеми',
            '圣诞岛'                          => 'Остров Рождества',
            '库拉索'                          => 'Кюрасао',
            '科科斯群岛'                      => 'Кокосовые острова (Килинг)',
            '南乔治亚岛和南桑威奇群岛'        => 'Южная Георгия и Южные Сандвичевы острова',
            '关岛'                            => 'Гуам',
            '赫德岛和麦克唐纳群岛'            => 'Остров Херд и острова Макдональда',
            '福克兰群岛(马尔维纳斯)'          => 'Фолклендские (Мальвинские) острова',
            '英属马恩岛'                      => 'Остров Мэн',
            '英属印度洋领地'                  => 'Британская территория в Индийском океане',
            '皮特凯恩群岛'                    => 'Питкэрн',
            '美国本土外小岛屿'                => 'Малые отдаленные острова США',
            '英属维尔京群岛'                  => 'Британские Виргинские острова',
            '圣赫勒拿岛'                      => 'Святая Елена',
            '泽西岛'                          => 'Джерси',
            '圣卢西亚'                        => 'Сент-Люсия',
            '斯瓦尔巴群岛'                    => 'Острова Шпицберген и Ян-Майен',
            '美属维尔京群岛'                  => 'Виргинские острова США',
            '瓦利斯和富图纳群岛'              => 'Острова Уоллис и Футуна',
            '圣马丁岛'                        => 'Синт-Мартен',
            '北马里亚纳群岛自由邦'            => 'Северные Марианские острова',
            '特克斯和凯科斯群岛'              => 'Острова Тёркс и Кайкос',
            '科索沃'                          => 'Косово',
            '法属南部领地'                    => 'Южные территории Франции',
            '诺福克岛'                        => 'Остров Норфолк',
            '纽埃'                            => 'Ниуэ',
            '托克劳群岛'                      => 'Токелау',
        ];

        return $list[$cnName] ?? $cnName;
    }

    /**
     * 中文国家名称 阿拉伯语国家名称
     */
    public static function getArName($cnName): string
    {

        $list = [
            '喀麦隆'                          => 'الكاميرون',
            '布基纳法索'                      => 'بوركينا فاسو',
            '留尼汪'                          => 'لم الشمل',
            '马约特岛'                        => 'مايوت',
            '莱索托'                          => 'ليسوتو',
            '纳米比亚'                        => 'ناميبيا',
            '阿尔及利亚'                      => 'الجزائر',
            '乌兹别克斯坦'                    => 'أوزبكستان',
            '老挝'                            => 'لاوس',
            '科威特'                          => 'الكويت',
            '马来西亚'                        => 'ماليزيا',
            '土库曼斯坦'                      => 'تركمانستان',
            '卡塔尔'                          => 'قطر',
            '东帝汶'                          => 'تيمور الشرقية',
            '文莱'                            => 'بروناي',
            '阿富汗'                          => 'أفغانستان',
            '巴林'                            => 'البحرين',
            '吉布提'                          => 'جيبوتي',
            '莫桑比克'                        => 'موزمبيق',
            '刚果'                            => 'الكونغو',
            '科摩罗'                          => 'جزر القمر',
            '加蓬'                            => 'الجابون',
            '厄立特里亚'                      => 'إريتريا',
            '贝宁'                            => 'بنين',
            '马达加斯加'                      => 'مدغشقر',
            '卢旺达'                          => 'رواندا',
            '塞舌尔'                          => 'سيشيل',
            '圣多美和普林西比'                => 'ساو تومي وبرينسيبي',
            '加纳'                            => 'غانا',
            '博茨瓦纳'                        => 'بوتسوانا',
            '南非'                            => 'جنوب أفريقيا',
            '埃塞俄比亚'                      => 'إثيوبيا',
            '冈比亚'                          => 'جوادلوب',
            '日本'                            => 'اليابان',
            '中国澳门'                        => 'ماكاو',
            '马尔代夫'                        => 'جزر المالديف',
            '也门'                            => 'اليمن',
            '尼泊尔'                          => 'نيبال',
            '哈萨克斯坦'                      => 'كازاخستان',
            '不丹'                            => 'بيوتان',
            '印度尼西亚'                      => 'إندونيسيا',
            '塔吉克斯坦'                      => 'طاجيكستان',
            '约旦'                            => 'الأردن',
            '赤道几内亚'                      => 'غينيا الاستوائية',
            '摩洛哥'                          => 'المغرب',
            '突尼斯'                          => 'تونس',
            '利比里亚'                        => 'ليبيريا',
            '塞内加尔'                        => 'السنغال',
            '坦桑尼亚'                        => 'تنزانيا',
            '马里'                            => 'مالي',
            '安哥拉'                          => 'أنجولا',
            '科特迪瓦'                        => 'ساحل العاج',
            '埃及'                            => 'مصر',
            '毛里求斯'                        => 'موريشيوس',
            '利比亚'                          => 'ليبيا',
            '津巴布韦'                        => 'زيمبابوي',
            '几内亚'                          => 'غينيا',
            '塞拉利昂'                        => 'سيراليون',
            '乍得'                            => 'تشاد',
            '乌干达'                          => 'أوغندا',
            '毛里塔尼亚'                      => 'موريتانيا',
            '索马里'                          => 'الصومال',
            '斯威士兰'                        => 'إيسواتيني',
            '几内亚比绍'                      => 'غينيا-بيساو',
            '民主刚果'                        => 'الكونغو الديمقراطية',
            '中非'                            => 'جمهورية أفريقيا الوسطى',
            '多哥'                            => 'توغو',
            '西撒哈拉'                        => 'الصحراء الغربية',
            '尼日尔'                          => 'النيجر',
            '赞比亚'                          => 'زامبيا',
            '马拉维'                          => 'ملاوي',
            '苏丹'                            => 'السودان',
            '越南'                            => 'فيتنام',
            '朝鲜'                            => 'كوريا الشمالية',
            '以色列'                          => 'إسرائيل',
            '柬埔寨'                          => 'كمبوديا',
            '菲律宾'                          => 'الفلبين',
            '巴基斯坦'                        => 'باكستان',
            '蒙古'                            => 'منغوليا',
            '巴勒斯坦'                        => 'فلسطين',
            '吉尔吉斯斯坦'                    => 'قيرغيزستان',
            '肯尼亚'                          => 'كينيا',
            '尼日利亚'                        => 'نيجيريا',
            '佛得角'                          => 'الرأس الأخضر',
            '新加坡'                          => 'سنغافورة',
            '布隆迪'                          => 'بوروندي',
            '韩国'                            => 'كوريا الجنوبية',
            '叙利亚'                          => 'سوريا',
            '阿联酋'                          => 'الإمارات العربية المتحدة',
            '斯里兰卡'                        => 'سريلانكا',
            '泰国'                            => 'تايلاند',
            '中国香港'                        => 'هونج كونج',
            '伊拉克'                          => 'العراق',
            '黎巴嫩'                          => 'لبنان',
            '缅甸'                            => 'ميانمار',
            '印度'                            => 'الهند',
            '阿曼'                            => 'عُمان',
            '孟加拉国'                        => 'بنغلاديش',
            '沙特阿拉伯'                      => 'المملكة العربية السعودية',
            '中国台湾'                        => 'تايوان',
            '中国'                            => 'الصين',
            '伊朗'                            => 'إيران',
            '萨尔瓦多'                        => 'سلفادور',
            '荷属安地列斯群岛'                => 'جزر الأنتيل الهولندية',
            '巴拿马'                          => 'بنما',
            '尼加拉瓜'                        => 'نيكاراغوا',
            '墨西哥'                          => 'المكسيك',
            '多米尼加'                        => 'الدومينيكي',
            '古巴'                            => 'كوبا',
            '哥斯达黎加'                      => 'كوستاريكا',
            '波多黎各'                        => 'بورتوريكو',
            '圣文森特和格纳丁斯'              => 'سانت فنسنت وجزر غرينادين',
            '洪都拉斯'                        => 'هندوراس',
            '危地马拉'                        => 'غواتيمالا',
            '格鲁吉亚'                        => 'جورجيا',
            '亚美尼亚'                        => 'أرمينيا',
            '阿塞拜疆'                        => 'أذربيجان',
            '罗马尼亚'                        => 'رومانيا',
            '挪威'                            => 'النرويج',
            '摩纳哥'                          => 'موناكو',
            '马耳他'                          => 'مالطا',
            '冰岛'                            => 'أيسلندا',
            '匈牙利'                          => 'المجر',
            '乌克兰'                          => 'أوكرانيا',
            '俄罗斯联邦'                      => 'روسيا',
            '白俄罗斯'                        => 'بيلاروسيا',
            '圣马力诺'                        => 'سان مارينو',
            '瑞典'                            => 'السويد',
            '瑞士'                            => 'سويسرا',
            '爱沙尼亚'                        => 'إستونيا',
            '拉脱维亚'                        => 'لاتفيا',
            '立陶宛'                          => 'ليتوانيا',
            '摩尔多瓦'                        => 'مولدوفا',
            '土耳其'                          => 'تركيا',
            '斯洛文尼亚'                      => 'سلوفينيا',
            '捷克'                            => 'التشيكية',
            '爱尔兰'                          => 'أيرلندا',
            '斯洛伐克'                        => 'سلوفاكيا',
            '比利时'                          => 'بلجيكا',
            '马其顿'                          => 'مقدونيا الشمالية',
            '塞浦路斯'                        => 'قبرص',
            '波斯尼亚和黑塞哥维那'            => 'البوسنة والهرسك',
            '丹麦'                            => 'الدنمارك',
            '英国'                            => 'بريطانيا العظمى',
            '德国'                            => 'ألمانيا',
            '法国'                            => 'فرنسا',
            '意大利'                          => 'إيطاليا',
            '梵蒂冈城国'                      => 'دولة مدينة الفاتيكان',
            '荷兰'                            => 'هولندا',
            '克罗地亚'                        => 'كرواتيا',
            '希腊'                            => 'اليونان',
            '卢森堡'                          => 'لوكسمبورغ',
            '保加利亚'                        => 'بلغاريا',
            '澳大利亚'                        => 'أستراليا',
            '密克罗尼西亚联邦'                => 'ميكرونيزيا',
            '帕劳'                            => 'بالاو',
            '智利'                            => 'تشيلي',
            '哥伦比亚'                        => 'كولومبيا',
            '马绍尔群岛'                      => 'جزر مارشال',
            '库克群岛'                        => 'جزر كوك',
            '芬兰'                            => 'فنلندا',
            '葡萄牙'                          => 'البرتغال',
            '波兰'                            => 'بولندا',
            '直布罗陀'                        => 'جبل طارق',
            '瑙鲁'                            => 'ناورو',
            '新喀里多尼亚'                    => 'كاليدونيا الجديدة',
            '多米尼克'                        => 'دومينيكا',
            '西班牙'                          => 'إسبانيا',
            '阿尔巴尼亚'                      => 'ألبانيا',
            '百慕大'                          => 'برمودا',
            '瓦努阿图'                        => 'فانواتو',
            '基里巴斯'                        => 'كيريباتي',
            '圭亚那'                          => 'غويانا',
            '巴拉圭'                          => 'باراجواي',
            '法属玻利尼西亚'                  => 'بولينيزيا الفرنسية',
            '秘鲁'                            => 'بيرو',
            '新西兰'                          => 'نيوزيلندا',
            '所罗门群岛'                      => 'جزر سليمان',
            '加拿大'                          => 'كندا',
            '安道尔'                          => 'أندورا',
            '列支敦士登'                      => 'ليختنشتاين',
            '美国'                            => 'الولايات المتحدة الأمريكية',
            '斐济'                            => 'فيجي',
            '萨摩亚'                          => 'ساموا',
            '格陵兰'                          => 'جرينلاند',
            '塞黑'                            => 'صربيا',
            '奥地利'                          => 'النمسا',
            '汤加'                            => 'تونغا',
            '图瓦卢'                          => 'توفالو',
            '巴布亚新几内亚'                  => 'بابوا غينيا الجديدة',
            '苏里南'                          => 'سورينام',
            '委内瑞拉'                        => 'فنزويلا',
            '乌拉圭'                          => 'أوروغواي',
            '厄瓜多尔'                        => 'إكوادور',
            '牙买加'                          => 'جامايكا',
            '伯利兹'                          => 'بليز',
            '博内尔岛、圣尤斯特歇斯岛和萨巴岛' => 'بونير سانت أوستاتيوس وسابا',
            '法罗群岛'                        => 'جزر فارو',
            '法属圭亚那'                      => 'غويانا الفرنسية',
            '玻利维亚'                        => 'بوليفيا',
            '马提尼克'                        => 'مارتينيك',
            '安提瓜和巴布达'                  => 'أنتيغوا وبربودا',
            '阿鲁巴岛'                        => 'أروبا',
            '蒙特塞拉特'                      => 'مونتسيرات',
            '巴西'                            => 'البرازيل',
            '根西岛'                          => 'غيرنسي',
            '布韦岛'                          => 'جزيرة بوفيه',
            '美属萨摩亚群岛'                  => 'ساموا الأمريكية',
            '特立尼达和多巴哥'                => 'ترينيداد وتوباغو',
            '巴哈马'                          => 'جزر البهاما',
            '巴巴多斯'                        => 'بربادوس',
            '开曼群岛'                        => 'جزر كايمان',
            '格林纳达'                        => 'غرينادا',
            '海地'                            => 'هايتي',
            '阿根廷'                          => 'الأرجنتين',
            '圣皮埃尔和密克隆'                => 'سان بيير وميكلون',
            '圣其茨-尼维斯'                   => 'سانت كيتس ونيفيس',
            '奥兰群岛'                        => 'جزر آلاند',
            '圣巴托洛缪岛'                    => 'القديس بارتيليمي',
            '圣诞岛'                          => 'جزيرة الكريسماس',
            '库拉索'                          => 'كوراساو',
            '科科斯群岛'                      => 'جزر كوكوس (كيلنج)',
            '南乔治亚岛和南桑威奇群岛'        => 'جورجيا الجنوبية وجزر ساندويتش الجنوبية',
            '关岛'                            => 'غوام',
            '赫德岛和麦克唐纳群岛'            => 'جزيرة هيرد وجزر ماكدونالد',
            '福克兰群岛(马尔维纳斯)'          => 'جزر فوكلاند (مالفيناس)',
            '英属马恩岛'                      => 'جزيرة مان',
            '英属印度洋领地'                  => 'إقليم المحيط الهندي البريطاني',
            '皮特凯恩群岛'                    => 'بيتكيرن',
            '美国本土外小岛屿'                => 'جزر الولايات المتحدة النائية الصغيرة',
            '英属维尔京群岛'                  => 'جزر فيرجن البريطانية',
            '圣赫勒拿岛'                      => 'القديسة هيلين',
            '泽西岛'                          => 'جيرسي',
            '圣卢西亚'                        => 'سانت لوسيا',
            '斯瓦尔巴群岛'                    => 'جزر سبيتسبيرجين وجان ماين',
            '美属维尔京群岛'                  => 'جزر فيرجن الأمريكية',
            '瓦利斯和富图纳群岛'              => 'جزر واليس وفوتونا',
            '圣马丁岛'                        => 'سينت مارتن',
            '北马里亚纳群岛自由邦'            => 'جزر ماريانا الشمالية',
            '特克斯和凯科斯群岛'              => 'جزر تركس وكايكوس',
            '科索沃'                          => 'كوسوفو',
            '法属南部领地'                    => 'المناطق الجنوبية من فرنسا',
            '诺福克岛'                        => 'جزيرة نورفولك',
            '纽埃'                            => 'نييوي',
            '托克劳群岛'                      => 'توكيلو',
        ];

        return $list[$cnName] ?? $cnName;
    }

}
